Revit 2027 API
BuiltInFailures.RebarShapeFailures.PlanarMultiPlanarShape Property
 The current shape is only bent in a single plane. A multi-planar definition is not required. Please redefine the shape on the top plane only.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PlanarMultiPlanarShape { get; }
Public Shared ReadOnly Property PlanarMultiPlanarShape As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PlanarMultiPlanarShape {
	FailureDefinitionId^ get ();
}
static member PlanarMultiPlanarShape : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace